#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/RobRoss/gh-actions-demo/runs/run-GnjqTdPjBMt6MZow

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
module.application.data.archive_file.function_package: Reading...
module.application.data.archive_file.function_package: Read complete after 0s [id=b9d0ddf04657ef6f1a547ca07ce3e028c9bb9b9b]
module.application.data.aws_iam_policy_document.permissions_role_policy_document: Reading...
module.application.data.aws_iam_policy_document.assume_role_policy_document: Reading...
module.application.data.aws_iam_policy_document.permissions_role_policy_document: Read complete after 0s [id=4262981604]
module.application.data.aws_iam_policy_document.assume_role_policy_document: Read complete after 0s [id=3693445097]
module.application.aws_iam_policy.permission_role_policy: Refreshing state... [id=arn:aws:iam::663729969216:policy/terraform-20220716153113943800000001]
module.application.aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
module.application.aws_iam_policy_attachment.lambda_role_permissions_policy_attachment: Refreshing state... [id=lambda-role-permissions-policy-attachment]
module.application.aws_lambda_function.app_function: Refreshing state... [id=app-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.application.aws_api_gateway_integration.app_api_integration will be created
  + resource "aws_api_gateway_integration" "app_api_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:663729969216:function:app-function/invocations"
    }

  # module.application.aws_api_gateway_method.app_api_method will be created
  + resource "aws_api_gateway_method" "app_api_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.application.aws_api_gateway_resource.app_api_resource will be created
  + resource "aws_api_gateway_resource" "app_api_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "resource"
      + rest_api_id = (known after apply)
    }

  # module.application.aws_api_gateway_rest_api.app_api will be created
  + resource "aws_api_gateway_rest_api" "app_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "app-function-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.application.aws_lambda_function.app_function will be updated in-place
  ~ resource "aws_lambda_function" "app_function" {
        id                             = "app-function"
      ~ last_modified                  = "2022-07-16T19:45:06.774+0000" -> (known after apply)
      ~ source_code_hash               = "VfWbt6cAq06ForIhXpfl00IrZMoWAbOxHbx3AAd3WHA=" -> "cAPCBVbAnxaEz2pxcL689iqAgRXWvWsjJQuzl+Uiy9U="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application.aws_lambda_permission.app_api_permission will be created
  + resource "aws_lambda_permission" "app_api_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "app-function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @Steven-Robinson, Action: `pull_request`*